[
    "Wall Street extended its 9-day winning streak, reclaiming losses from trade tensions. Strong job growth & optimism fueled the rally, but uncertainty remains.",
    "Trump's proposed 2026 budget seeks a 23% cut in domestic spending & a 13% defense increase. Democrats oppose, while Trump promises tax cuts & debt reduction. The plan faces Congressional hurdles amid a $36T debt & $2T deficits.",
    "US job growth exceeded expectations in April (177k), despite trade tensions & a revised lower March. Healthcare, transport, & restaurants saw gains. Unemployment remains steady at 4.2%, but tariffs & workforce cuts could impact future growth.",
    "Trump threatens to revoke Harvard's tax-exempt status over antisemitism claims & lack of free speech protections. The move follows suspended federal funding & demands for changes, prompting Harvard to sue & defend its autonomy. Professors pledged salary cuts to fight funding loss.",
    "Trump signed an executive order to cut federal funding (~$500M) to PBS and NPR, citing alleged bias. PBS warns of service disruption, while NPR is taking legal action. The move faces legal challenges and is part of a larger budget package.",
    "Australia's Anthony Albanese secured a second term as Prime Minister in a projected election victory, marking the first back-to-back win in over 20 years. Labor is expected to win 86 seats, with Dutton conceding defeat. Albanese emphasized a vote for fairness and opportunity.",
    "NYPD shared a Palestinian protester's info with ICE, potentially violating sanctuary laws. The info is now evidence in her deportation case, sparking debate over government targeting of political speech & noncitizen rights. 34 sources cover the story.",
    "NYPD shared a Palestinian protester's info with ICE, potentially violating sanctuary laws. The info is now evidence in her deportation case, raising concerns about political speech & noncitizen rights amid info-sharing. 43% Left, 43% Center coverage.",
 	"US DOJ sued Colorado & Denver, alleging their \"sanctuary\" laws interfere with federal immigration enforcement & violate the Supremacy Clause. Both sides dispute the claims.",
    "Trump dismissed climate scientists, prompting scientific societies to collaborate & produce their own assessments to fill the gap & ensure climate change awareness.",
    "Texas residents will vote May 3, 2025, on incorporating Elon Musk's SpaceX Starbase as a city. The move aims to grant SpaceX greater local control amid disputes over road access & beach closures, following legislative rejections. Roughly 200 of 283 voters (mostly SpaceX employees) have already cast ballots.",
    "US authorized $3.5B missile sale to Saudi Arabia ahead of Trump's visit, including 1,000 missiles. Part of a potential $100B arms package, it aims to strengthen regional security & is now before Congress for review.",
    "AmeriCorps funding cuts, initiated by the Department of Government Efficiency, have halted 80% of programs, impacting service members and community organizations across multiple states. This has triggered lawsuits and a scramble for alternative funding amid concerns about program sustainability."
]